In [4]:
import numpy as np
from matplotlib import pyplot as plt
import pandas as pd

data = pd.read_csv('netflix.csv', delimiter=',', usecols=[4,9,11])
data

,country,listed_in,type
0,South Korea,"International TV Shows, Korean TV Shows, Roman...",TV Show
1,NaN,"Documentaries, International Movies",Movie
2,India,"Comedies, Dramas, International Movies",Movie
3,"France, Senegal, Belgium","Dramas, Independent Movies, International Movies",Movie
4,"Canada, United Kingdom",Kids' TV,TV Show
...,...,...,...
5832,United States,"Cult Movies, Horror Movies",Movie
5833,United States,Horror Movies,Movie
5834,Denmark,"Dramas, International Movies",Movie
5835,United States,Stand-Up Comedy & Talk Shows,TV Show
5836,United States,"Dramas, Independent Movies, Thrillers",Movie

In [21]:
sorted = data.sort_values(['country', 'listed_in'],na_position='first')
sorted

           country                                          listed_in     type
253            NaN   Action & Adventure, Comedies, Independent Movies    Movie
2067           NaN  Action & Adventure, Comedies, International Mo...    Movie
708            NaN  Anime Series, Crime TV Shows, International TV...  TV Show
248            NaN               Anime Series, International TV Shows  TV Show
1037           NaN               Anime Series, International TV Shows  TV Show
...            ...                                                ...      ...
4354       Vietnam  Action & Adventure, Comedies, International Mo...    Movie
535        Vietnam   Action & Adventure, Dramas, International Movies    Movie
2594       Vietnam             Comedies, Dramas, International Movies    Movie
2853       Vietnam     Horror Movies, International Movies, Thrillers    Movie
5115  West Germany                Documentaries, International Movies    Movie

[5837 rows x 3 columns]

In [8]:
ignore_nan = sorted.dropna(0)
ignore_nan

           country                                          listed_in   type
3325     Argentina  Action & Adventure, Comedies, International Mo...  Movie
5242     Argentina  Action & Adventure, Horror Movies, Internation...  Movie
109      Argentina         Children & Family Movies, Music & Musicals  Movie
3092     Argentina        Comedies, Cult Movies, International Movies  Movie
5139     Argentina                     Comedies, International Movies  Movie
...            ...                                                ...    ...
4354       Vietnam  Action & Adventure, Comedies, International Mo...  Movie
535        Vietnam   Action & Adventure, Dramas, International Movies  Movie
2594       Vietnam             Comedies, Dramas, International Movies  Movie
2853       Vietnam     Horror Movies, International Movies, Thrillers  Movie
5115  West Germany                Documentaries, International Movies  Movie

[5410 rows x 3 columns]

In [28]:
most_popular_countries = ignore_nan['country'].value_counts(normalize=True).round(4) * 100
most_popular_countries

United States                                         35.25
India                                                 12.88
United Kingdom                                         6.21
Japan                                                  3.11
Canada                                                 2.57
                                                      ...
Chile, Argentina                                       0.02
Finland, Sweden, Norway, Latvia, Germany               0.02
United Kingdom, Italy, Israel, Peru, United States     0.02
Finland, Germany                                       0.02
Mexico, Finland                                        0.02
Name: country, Length: 527, dtype: float64

In [37]:
top_5_countries = most_popular_countries[most_popular_countries > 2.5]
top_5_countries

United States     35.25
India             12.88
United Kingdom     6.21
Japan              3.11
Canada             2.57
Name: country, dtype: float64